_posts/2015-03-16-shapado.html
---
layout: post
category: computer science and enginneering
title: "A part of Sahpado source"
description: ""
tags: [Rails, Shapado]
---
{% include JB/setup %}
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Shapado uses Rack middleware</a></li>
<li><a href="#sec-2">Mongoid-ext</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Shapado uses Rack middleware</h2>
<div class="outline-text-2" id="text-1">
<p>
In Theme, it uses mongoid_ext/file_server.rb to finish middleware.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Mongoid-ext</h2>
<div class="outline-text-2" id="text-2">
<p>
Add a type file_key, in Theme's filed stylesheet is a file_key. The file_key includes meta data: _id, name, content_type, and extension.
</p>

<p>
The number of meta data can be appended during initializaion: such as:
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #b5bd68;">def</span> <span style="color: #f0c674;">self</span>.<span style="color: #de935f;">generate_stylesheet</span>(theme_id){
  theme.stylesheet = css
  theme.stylesheet[<span style="color: #8abeb7;">"extension"</span>] = <span style="color: #8abeb7;">"css"</span>
  theme.stylesheet[<span style="color: #8abeb7;">"content_type"</span>] = <span style="color: #8abeb7;">"text/css"</span>
  theme.stylesheet[<span style="color: #8abeb7;">"content_type1"</span>] = <span style="color: #8abeb7;">"text/css"</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">append it freely</span>
}
</pre>
</div>


<p>
Group.set_default_theme -&gt; create_defaule -&gt; Themes.generate_stylesheet
</p>

<p>
file_key define a dynamic method using Module#define_method()
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #b294bb;">define_method</span>(<span style="color: #8abeb7;">"</span><span style="color: #f0c674;">#{name}</span><span style="color: #8abeb7;">="</span>) <span style="color: #b5bd68;">do</span> |file| 
<span style="color: #b5bd68;">end</span>
</pre>
</div>

<p>
so if I define a field theme.stylesheet type file_key:
</p>
<div class="org-src-container">

<pre class="src src-ruby">theme.stylesheet = css
</pre>
</div>

<p>
the above definition will be evaluated.
</p>

<p>
file_key's real type is StringIO or File, such as stylesheet is StrongIO, and bg_image is File
</p>

<p>
File &lt; EmbeddedHash uses Magic ffn (<a href="https://github.com/qoobaa/magic">https://github.com/qoobaa/magic</a>)
</p>


<p>
There is a snippet code about Ruby's dynamic method, 
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #b5bd68;">module</span> <span style="color: #81a2be;">MyMod</span>

  <span style="color: #b5bd68;">def</span> <span style="color: #f0c674;">self</span>.<span style="color: #de935f;">included</span>(target)
    target.send(<span style="color: #81a2be;">:include</span>, <span style="color: #81a2be;">InstanceMethods</span>)
    target.extend <span style="color: #81a2be;">ClassMethods</span>
    target.class_eval <span style="color: #b5bd68;">do</span>
      file_list <span style="color: #81a2be;">:xoxo</span>
    <span style="color: #b5bd68;">end</span>
  <span style="color: #b5bd68;">end</span>

  <span style="color: #b5bd68;">module</span> <span style="color: #81a2be;">InstanceMethods</span>
    <span style="color: #b5bd68;">def</span> <span style="color: #de935f;">an_instance_method</span>
    <span style="color: #b5bd68;">end</span>
  <span style="color: #b5bd68;">end</span>

  <span style="color: #b5bd68;">module</span> <span style="color: #81a2be;">ClassMethods</span>
    <span style="color: #b5bd68;">def</span> <span style="color: #de935f;">file_list</span>(name)
      <span style="color: #b294bb;">define_method</span>(name) <span style="color: #b5bd68;">do</span>
        <span style="color: #b294bb;">puts</span> <span style="color: #8abeb7;">"file_list called"</span>
      <span style="color: #b5bd68;">end</span>
    <span style="color: #b5bd68;">end</span>

    <span style="color: #b5bd68;">def</span> <span style="color: #de935f;">file_key</span>(name)
      <span style="color: #b294bb;">define_method</span>(name) <span style="color: #b5bd68;">do</span>
        <span style="color: #b294bb;">puts</span> <span style="color: #8abeb7;">"file_key called"</span>
        send(<span style="color: #81a2be;">:xoxo</span>)
      <span style="color: #b5bd68;">end</span>
    <span style="color: #b5bd68;">end</span>
  <span style="color: #b5bd68;">end</span>
<span style="color: #b5bd68;">end</span>

<span style="color: #b5bd68;">class</span> <span style="color: #81a2be;">MyClass</span>
  <span style="color: #b294bb;">include</span> <span style="color: #81a2be;">MyMod</span>
  file_key <span style="color: #81a2be;">:stylesheet</span>
<span style="color: #b5bd68;">end</span>

<span style="color: #b294bb;">puts</span> <span style="color: #81a2be;">MyClass</span>.singleton_methods <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">=&gt; [:file_list, :file_key] </span>
<span style="color: #81a2be;">MyClass</span>.new.stylesheet
<span style="color: #b294bb;">puts</span> <span style="color: #81a2be;">MyClass</span>.instance_methods(<span style="color: #f0c674;">false</span>) <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">=&gt; [:xoxo, :stylesheet, :""]</span>
</pre>
</div>
<p>
Specially, "send(:xoxo)" will call a method called "xoxo", the block defined in:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #b294bb;">define_method</span>(name) <span style="color: #b5bd68;">do</span>
   <span style="color: #b294bb;">puts</span> <span style="color: #8abeb7;">"file_list called"</span>
<span style="color: #b5bd68;">end</span>
</pre>
</div>

<p>
So, output "file_list called". "xoxo" method is defined through "file_list :xoxo", called dynamic method. Also, "stylesheet" is like.
If using "ActiveSupport":
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #b294bb;">require</span> <span style="color: #8abeb7;">'active_support'</span>
<span style="color: #b5bd68;">module</span> <span style="color: #81a2be;">MyMod</span>

  <span style="color: #b294bb;">extend</span> <span style="color: #81a2be;">ActiveSupport</span>::<span style="color: #81a2be;">Concern</span>

  included <span style="color: #b5bd68;">do</span>
    file_list <span style="color: #81a2be;">:xoxo</span>
  <span style="color: #b5bd68;">end</span>

  <span style="color: #b5bd68;">def</span> <span style="color: #de935f;">an_instance_method</span>
  <span style="color: #b5bd68;">end</span>

  <span style="color: #b5bd68;">module</span> <span style="color: #81a2be;">ClassMethods</span>

    <span style="color: #b5bd68;">def</span> <span style="color: #de935f;">file_list</span>(name)
      <span style="color: #b294bb;">define_method</span>(name) <span style="color: #b5bd68;">do</span>
        <span style="color: #b294bb;">puts</span> <span style="color: #8abeb7;">"file_list called"</span>
      <span style="color: #b5bd68;">end</span>
    <span style="color: #b5bd68;">end</span>

    <span style="color: #b5bd68;">def</span> <span style="color: #de935f;">file_key</span>(name)
      <span style="color: #b294bb;">define_method</span>(name) <span style="color: #b5bd68;">do</span>
        <span style="color: #b294bb;">puts</span> <span style="color: #8abeb7;">"file_key called"</span>
        send(<span style="color: #81a2be;">:xoxo</span>)
      <span style="color: #b5bd68;">end</span>
    <span style="color: #b5bd68;">end</span>
  <span style="color: #b5bd68;">end</span>
<span style="color: #b5bd68;">end</span>

<span style="color: #b5bd68;">class</span> <span style="color: #81a2be;">MyClass</span>
  <span style="color: #b294bb;">include</span> <span style="color: #81a2be;">MyMod</span>

  file_key <span style="color: #81a2be;">:stylesheet</span>
<span style="color: #b5bd68;">end</span>

<span style="color: #b294bb;">puts</span> <span style="color: #81a2be;">MyClass</span>.singleton_methods <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">=&gt; [:file_list, :file_key] </span>
<span style="color: #81a2be;">MyClass</span>.new.stylesheet
<span style="color: #b294bb;">puts</span> <span style="color: #81a2be;">MyClass</span>.instance_methods(<span style="color: #f0c674;">false</span>) <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">=&gt; [:xoxo, :stylesheet, :""]</span>
</pre>
</div>

<p>
file_key is defined in "MongoidExt::Storage", which use the above method to specify the capability using "define_method("#{name=})", "define_method(name)" or "define_method("has_#{name}?")".
</p>

<p>
field is defined in mongoid/lib/fields.rb
</p>
</div>
</div>
